GCN(
  (gcn_convs): ModuleList(
    (0): GCNConv(128, 256)
    (1-2): 2 x GCNConv(256, 256)
  )
  (norms): ModuleList(
    (0-2): 3 x BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (output_proj): Sequential(
    (0): Linear(in_features=256, out_features=128, bias=True)
    (1): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (2): ReLU()
  )
)